{
	"@metadata": {
		"authors": [
			"Jeblad",
			"Verdy p"
		]
	},
	"bcmath-desc": "{{bcmath-gloss}} {{desc|name=BCmath|url=https://www.mediawiki.org/wiki/Extension:BCmath }}",
	"bcmath-check-self-nan": "{{bcmath-gloss}} An exception has been catched during parsing of a number. This can be because of an error in the cript logic, but can also be an erroneous entry by the user. The “self” is the internal instance, which has a non-valid number, or actually has no number at all. This is interpreted as a “NaN” or “Not a Number”.",
	"bcmath-check-operand-nan": "{{bcmath-gloss}} An exception has been catched during parsing of a number. This can be because of an error in the cript logic, but can also be an erroneous entry by the user. The operand “$1” is the name or the role for the argument, which has a non-valid number, or actually has no number at all. This is interpreted as a “NaN” or “Not a Number”.",
	"bcmath-add-singlesided-infinite": "Depending on application choice, a valid result may be throwing an exception/error with this message, or returning the given infinite value.",
	"bcmath-add-opposite-infinites": "Depending on application choice, a valid result may be throwing an exception/error with this message, or returning an undefined value (NaN).",
	"bcmath-add-similar-infinites": "Depending on application choice, a valid result may be throwing an exception/error with this message, or returning any one of the two given infinite values.",
	"bcmath-sub-singlesided-infinite": "Depending on application choice, a valid result may be throwing an exception/error with this message, or returning either the given infinite value (if it's in the first operand) or its opposite (if it's in the second operand).",
	"bcmath-sub-opposite-infinites": "Depending on application choice, a valid result may be throwing an exception/error with this message, or returning the given infinite value in the first operand.",
	"bcmath-mul-opposite-infinites": "Depending on application choice, a valid result may be throwing an exception/error with this message, or returning a negative infinite value.",
	"bcmath-mul-similar-infinites": "Depending on application choice, a valid result may be throwing an exception/error with this message, or returning a positive infinite value."
}
